// #include <iostream> // 헤더파일 -> 무조건 써야하는 것

/* 1. 함수정의
void func() {			// 함수 이름 : func, 입력 : X, 출력 : X

}

void func1(int a) {		// 함수 이름 : func1, 입력 : int a, 출력 : X

}

int func2() {			// 함수 이름 : func2, 입력 : X, 출력 : int, 매개변수 -> X


	return int(정수);	// 함수를 반환하는 값(return) => 반환될 값 int(정수) -> int 형식으로 반환
}
*/

/* 2. 함수호출
* func();	// 함수머리에서 출력 생략
* func1();
* func2();
*/

// num이라는 변수에 10을 저장하자.
// int num;		// 변수 선언 후		-> 변수 선언 : 메모리에 저장할 수 있는 공간 선언
// num = 10;	// 변수에 값을 대입

// 함수와 변수의 차이 => 괄호
// 함수 : num(), 변수 : num



// 변수 선언 먼저
// 함수 사용시, 함수 선언하고 사용하고, 호출하기
// 함수 정의 선언 => 사용하기 위해서 => 함수 적고  => 함수 호출
// 변수 (램 = 저장하는 메모리 공간) => 선언하고 함수 작성시 밑에 
// 함수 => 정의 => 호출 